; domain
;; Source: https://github.com/josej30/Planner-Sat-Constraints

(define (domain logistics)

(:requirements :strips :typing) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location ?c - city)
         :precondition  (and (at ?t ?from)
                             (in-city ?from ?c)
                             (in-city ?to ?c))
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem logistics-c3-s1-p6-a1)

(:domain logistics)

(:objects a0 - airplane
          c0 c1 c2 - city
          t0 t1 t2 t3 t4 t5 t6 t7 t8 - truck
          l0-0 l1-0 l2-0 - airport
          p0 p1 p2 p3 p4 p5 - package
)

(:init
    (in-city  l0-0 c0)
    (in-city  l1-0 c1)
    (in-city  l2-0 c2)
    (at t0 l0-0)
    (at t1 l1-0)
    (at t2 l2-0)
    (at t3 l1-0)
    (at t4 l2-0)
    (at t5 l1-0)
    (at t6 l0-0)
    (at t7 l2-0)
    (at t8 l0-0)
    (at p0 l0-0)
    (at p1 l1-0)
    (at p2 l1-0)
    (at p3 l0-0)
    (at p4 l1-0)
    (at p5 l2-0)
    (at a0 l2-0)
)

(:goal
    (and
        (at p0 l2-0)
        (at p1 l2-0)
        (at p2 l2-0)
        (at p3 l0-0)
        (at p4 l0-0)
        (at p5 l1-0)
    )
)
)

; plan
1. (load a0 p5 l2-0)
   deleted: (at p5 l2-0)
   added: (in p5 a0)
   goals met: 1 of 6
2. (load t6 p3 l0-0)
   deleted: (at p3 l0-0)
   added: (in p3 t6)
   goals met: 0 of 6
3. (fly a0 l2-0 l1-0)
   deleted: (at a0 l2-0)
   added: (at a0 l1-0)
   goals met: 0 of 6
4. (load a0 p1 l1-0)
   deleted: (at p1 l1-0)
   added: (in p1 a0)
   goals met: 0 of 6
5. (load a0 p2 l1-0)
   deleted: (at p2 l1-0)
   added: (in p2 a0)
   goals met: 0 of 6
6. (load a0 p4 l1-0)
   deleted: (at p4 l1-0)
   added: (in p4 a0)
   goals met: 0 of 6
7. (load t6 p0 l0-0)
   deleted: (at p0 l0-0)
   added: (in p0 t6)
   goals met: 0 of 6
8. (unload a0 p5 l1-0)
   deleted: (in p5 a0)
   added: (at p5 l1-0)
   goals met: 1 of 6
9. (unload t6 p0 l0-0)
   deleted: (in p0 t6)
   added: (at p0 l0-0)
   goals met: 1 of 6
10. (fly a0 l1-0 l0-0)
   deleted: (at a0 l1-0)
   added: (at a0 l0-0)
   goals met: 1 of 6
11. (load a0 p0 l0-0)
   deleted: (at p0 l0-0)
   added: (in p0 a0)
   goals met: 1 of 6
12. (unload a0 p4 l0-0)
   deleted: (in p4 a0)
   added: (at p4 l0-0)
   goals met: 2 of 6
13. (fly a0 l0-0 l2-0)
   deleted: (at a0 l0-0)
   added: (at a0 l2-0)
   goals met: 2 of 6
14. (unload a0 p0 l2-0)
   deleted: (in p0 a0)
   added: (at p0 l2-0)
   goals met: 3 of 6
15. (unload a0 p1 l2-0)
   deleted: (in p1 a0)
   added: (at p1 l2-0)
   goals met: 4 of 6
16. (unload a0 p2 l2-0)
   deleted: (in p2 a0)
   added: (at p2 l2-0)
   goals met: 5 of 6
17. (unload t6 p3 l0-0)
   deleted: (in p3 t6)
   added: (at p3 l0-0)
   goals met: 6 of 6
